capitals=['Сухум','Канберра','Вена','Баку','Тирана','Алжир','Луанда',
          'Андорра-ла-Велья','Сент-Джонс','Буэнос-Айрес','Ереван','Кабул',
          'Нассау','Дакка','Бриджтаун','Манама','Бельмопан','Минск','Брюссель',
          'Порто-Ново','София','Ла-Пас','Сараево','Габороне','Бразилиа',
          'Бандар-Сери-Бегаван','Уагадугу','Бужумбура','Тхимпху','Вила'
          'Ватикан','Лондон','Будапешт','Каракас','Дили','Ханой','Либревиль',
          'Порт-о-Пренс','Джорджтаун','Банжул','Аккра','Гватемала','Конакри',
          'Бисау','Берлин','Тегусигальпа','Сент-Джорджес','Афины','Тбилиси',
          'Копенгаген','Джибути','Розо','Санто-Доминго','Каир','Лусака','Хараре',
          'Иерусалим','Нью-Дели','Джакарта','Амман','Багдад','Тегеран','Дублин',
          'Рейкьявик','Мадрид','Рим','Сана','Прая','Астана','Пномпень',
          'Яунде','Оттава','Доха','Найроби','Никоcия','Бишкек','Тарава','Пекин',
          'Богота','Морони','Браззавиль','Киншаса','Пхеньян','Сеул','Приштина',
          'Сан-Хосе','Ямусукро','Гавана','Эль-Кувейт','Бишкек','Вьентьян','Рига',
          'Масеру','Монровия','Бейрут','Триполи','Вильнюс','Вадуц','Люксембург',
          'Порт-Луи','Нуакшот','Антананариву','Скопье','Лилонгве','Куала-Лумпур',
          'Бамако','Мале','Валетта','Рабат','Маджуро''Мехико','Паликир','Мапуту',
          'Кишинев','Монако','Улан-Батор','Янгон','Виндхук','Ярен','Катманду'
          'Ниамей','Абуджа','Амстердам','Манагуа','Веллингтон','Осло','Абу-Даби',
          'Маскат','Цхинвали','Исламабад''Корор','Панама', 'Порт-Морсби','Асунсьон',
          'Лима','Варшава','Лиссабон','Сан-Хуан','Москва','Кигали','Бухарест', 
          'Сан-Сальвадор','Апиа','Сан-Марино','Сан-Томе','Эр-Рияд','Мбабане',
          'Виктория','Дакар','Кингстаун','Бастер','Кастри','Белград','Сингапур',
          'Дамаск','Братислава','Любляна','Хониаpа','Могадишо','Хаpтум','Паpамаpибо',
          'Вашингтон','Фpитаун','Душанбе','Бангкок','Тайпей','Додома','Ломе',
          'Нукуалофа','Порт-оф-Спейн','Фунафути','Тунис','Ашхабад','Анкаpа','Кампала',
          'Ташкент','Киев','Монтевидео','Сува','Манила','Хельсинки','Париж','Папеэте',
          'Загреб','Банги','Нджамена','Цетине','Прага','Сантьяго','Берн','Стокгольм',
          'Коломбо','Кито','Малабо','Асмэра','Таллинн','Аддис-Абеба','Претория',
          'Кингстон','Токио']
countries=['Абхазия','Австралия','Австрия','Азербайджан','Албания','Алжир','Ангола','Андорра',
           'Антигуа и Барбуда','Аргентина','Армения','Афганистан','Багамские острова','Бангладеш',
           'Барбадос','Бахрейн','Белиз','Беларусь','Бельгия','Бенин','Болгария','Боливия',
           'Босния и Герцеговина', 'Ботсвана','Бразилия','Бруней','Буркина-Фасо','Бурунди',
           'Бутан','Вануату','Ватикан','Великобритания','Венгрия','Венесуэла','Восточный Тимор',
           'Вьетнам','Габон','Гаити','Гайана','Гамбия','Гана','Гватемала','Гвинея','Гвинея-Бисау',
           'Германия','Гондурас','Гренада','Греция','Грузия','Дания','Джибути','Доминика',
           'Доминикана','Египет','Замбия','Зимбабве','Израиль','Индия','Индонезия','Иордания',
           'Ирак','Иран','Ирландия','Исландия','Испания','Италия','Йемен','Кабо-Верде','Казахстан',
           'Камбоджа','Камерун','Канада','Катар','Кения','Кипр','Киргизия','Кирибати','Китай',
           'Колумбия','Коморские острова','Конго','Конго (Демокр. респуб.)','Северная Корея',
           'Южная Корея','Косово', 'Коста-Рика','Кот-д-Ивуар','Куба','Кувейт','Кыргызстан','Лаос',
           'Латвия','Лесото','Либерия','Ливан','Ливия', 'Литва', 'Лихтенштейн', 'Люксембург',
           'Маврикий', 'Мавритания', 'Мадагаскар', 'Македония', 'Малави', 'Малайзия', 'Мали',
           'Мальдивы', 'Мальта', 'Марокко', 'Маршалловы острова', 'Мексика', 'Микронезия',
           'Мозамбик','Молдова', 'Монако','Монголия','Мьянма','Намибия', 'Науру', 'Непал', 'Нигер',
           'Нигерия', 'Нидерланды', 'Никарагуа', 'Новая Зеландия', 'Норвегия', 'ОАЭ', 'Оман','Южная Осетия',
           'Пакистан', 'Палау', 'Панама', 'Папуа-Новая Гвинея', 'Парагвай', 'Перу', 'Польша', 'Португалия',
           'Пуэрто-Рико', 'Россия', 'Руанда', 'Румыния','Сальвадор', 'Самоа','Сан-Марино', 'Сан-Томе и Принсипи',
           'Саудовская Аравия', 'Свазиленд', 'Сейшельские Острова', 'Сенегал','Сент-Винсент и Гренадины',
           'Сент-Китс и Невис', 'Сент-Люсия', 'Сербия', 'Сингапур','Сирия', 'Словакия','Словения',
           'Соломоновы острова', 'Сомали', 'Судан', 'Суринам', 'США','Сьерра-Леоне', 'Таджикистан', 'Таиланд', 
           'Тайвань', 'Танзания', 'Того', 'Тонго', 'Тринидад и Тобаго', 'Тувалу', 'Тунис', 'Туркменистан',
           'Турция', 'Уганда', 'Узбекистан', 'Украина', 'Уругвай', 'Фиджи', 'Филиппины','Финляндия','Франция',
           'Французская Полинезия', 'Хорватия','ЦАР', 'Чад', 'Черногория', 'Чехия', 'Чили', 'Швейцария', 'Швеция',
           'Шри-Ланка', 'Эквадор', 'Экваториальная Гвинея', 'Эритрея','Эстония', 'Эфиопия', 'ЮАР', 'Ямайка', 'Япония']
CorrectDir={'Абхазия': 'Сухум', 'Австралия': 'Канберра', 'Австрия': 'Вена', 'Азербайджан':
    'Баку', 'Албания': 'Тирана', 'Алжир': 'Алжир', 'Ангола': 'Луанда', 'Андорра':
    'Андорра-ла-Велья', 'Антигуа и Барбуда': 'Сент-Джонс', 'Аргентина': 'Буэнос-Айрес',
    'Армения': 'Ереван', 'Афганистан': 'Кабул', 'Багамские острова': 'Нассау',
    'Бангладеш': 'Дакка', 'Барбадос': 'Бриджтаун', 'Бахрейн': 'Манама', 'Белиз':
    'Бельмопан', 'Беларусь': 'Минск', 'Бельгия': 'Брюссель', 'Бенин': 'Порто-Ново',
    'Болгария': 'София', 'Боливия': 'Ла-Пас', 'Босния и Герцеговина': 'Сараево',
    'Ботсвана': 'Габороне', 'Бразилия': 'Бразилиа', 'Бруней': 'Бандар-Сери-Бегаван',
    'Буркина-Фасо': 'Уагадугу', 'Бурунди': 'Бужумбура', 'Бутан': 'Тхимпху', 
    'Вануату': 'Вила', 'Ватикан': 'Ватикан', 'Великобритания': 'Лондон', 'Венгрия':
    'Будапешт', 'Венесуэла': 'Каракас', 'Восточный Тимор': 'Дили', 'Вьетнам': 
    'Ханой', 'Габон': 'Либревиль', 'Гаити': 'Порт-о-Пренс', 'Гайана': 'Джорджтаун',
    'Гамбия': 'Банжул', 'Гана': 'Аккра', 'Гватемала': 'Гватемала', 'Гвинея':
    'Конакри', 'Гвинея-Бисау': 'Бисау', 'Германия': 'Берлин', 'Гондурас': 'Тегусигальпа',
    'Гренада': 'Сент-Джорджес', 'Греция': 'Афины', 'Грузия': 'Тбилиси', 'Дания':
    'Копенгаген', 'Джибути': 'Джибути', 'Доминика': 'Розо', 'Доминикана': 'Санто-Доминго',
    'Египет': 'Каир', 'Замбия': 'Лусака', 'Зимбабве': 'Хараре', 'Израиль': 'Иерусалим',
    'Индия': 'Нью-Дели', 'Индонезия': 'Джакарта', 'Иордания': 'Амман', 'Ирак':
            'Багдад', 'Иран': 'Тегеран', 'Ирландия': 'Дублин', 'Исландия': 'Рейкьявик',
            'Испания': 'Мадрид', 'Италия': 'Рим', 'Йемен': 'Сана', 'Кабо-Верде': 'Прая',
            'Казахстан': 'Астана', 'Камбоджа': 'Пномпень', 'Камерун': 'Яунде', 'Канада':
            'Оттава', 'Катар': 'Доха', 'Кения': 'Найроби', 'Кипр': 'Никоcия', 'Киргизия':
            'Бишкек', 'Кирибати': 'Тарава', 'Китай': 'Пекин', 'Колумбия': 'Богота', 
            'Коморские острова': 'Морони', 'Конго': 'Браззавиль', 'Конго (Демокр. респуб.)':
            'Киншаса', 'Северная Корея': 'Пхеньян', 'Южная Корея': 'Сеул', 'Косово': 'Приштина',
            'Коста-Рика': 'Сан-Хосе', 'Кот-д-Ивуар': 'Ямусукро', 'Куба': 'Гавана', 'Кувейт':
            'Эль-Кувейт', 'Кыргызстан': 'Бишкек', 'Лаос': 'Вьентьян', 'Латвия': 'Рига',
            'Лесото': 'Масеру', 'Либерия': 'Монровия', 'Ливан': 'Бейрут', 'Ливия': 'Триполи',
            'Литва': 'Вильнюс', 'Лихтенштейн': 'Вадуц', 'Люксембург': 'Люксембург', 'Маврикий':
            'Порт-Луи', 'Мавритания': 'Нуакшот', 'Мадагаскар': 'Антананариву', 'Македония':
            'Скопье', 'Малави': 'Лилонгве', 'Малайзия': 'Куала-Лумпур', 'Мали': 'Бамако', 
            'Мальдивы': 'Мале', 'Мальта': 'Валетта', 'Марокко': 'Рабат', 'Маршалловы острова':
            'Маджуро', 'Мексика': 'Мехико', 'Микронезия': 'Паликир', 'Мозамбик': 'Мапуту', 
            'Молдова': 'Кишинев', 'Монако': 'Монако', 'Монголия': 'Улан-Батор', 'Мьянма':
            'Янгон', 'Намибия': 'Виндхук', 'Науру': 'Ярен', 'Непал': 'Катманду', 'Нигер':
            'Ниамей', 'Нигерия': 'Абуджа', 'Нидерланды': 'Амстердам', 'Никарагуа': 'Манагуа',
            'Новая Зеландия': 'Веллингтон', 'Норвегия': 'Осло', 'ОАЭ': 'Абу-Даби', 'Оман':
            'Маскат', 'Южная Осетия': 'Цхинвали', 'Пакистан': 'Исламабад', 'Палау': 'Корор',
            'Панама': 'Панама', 'Папуа-Новая Гвинея': 'Порт-Морсби', 'Парагвай': 'Асунсьон',
            'Перу': 'Лима', 'Польша': 'Варшава', 'Португалия': 'Лиссабон', 'Пуэрто-Рико':
            'Сан-Хуан', 'Россия': 'Москва', 'Руанда': 'Кигали', 'Румыния': 'Бухарест',
            'Сальвадор': 'Сан-Сальвадор', 'Самоа': 'Апиа', 'Сан-Марино': 'Сан-Марино',
            'Сан-Томе и Принсипи': 'Сан-Томе', 'Саудовская Аравия': 'Эр-Рияд', 'Свазиленд':
            'Мбабане', 'Сейшельские Острова': 'Виктория', 'Сенегал': 'Дакар', 'Сент-Винсент и Гренадины':
            'Кингстаун', 'Сент-Китс и Невис': 'Бастер', 'Сент-Люсия': 'Кастри', 'Сербия':
            'Белград', 'Сингапур': 'Сингапур', 'Сирия': 'Дамаск', 'Словакия': 'Братислава',
            'Словения': 'Любляна', 'Соломоновы острова': 'Хониаpа', 'Сомали': 'Могадишо',
            'Судан': 'Хаpтум', 'Суринам': 'Паpамаpибо', 'США': 'Вашингтон', 'Сьерра-Леоне':
            'Фpитаун', 'Таджикистан': 'Душанбе', 'Таиланд': 'Бангкок', 'Тайвань': 'Тайпей',
            'Танзания': 'Додома', 'Того': 'Ломе', 'Тонго': 'Нукуалофа', 'Тринидад и Тобаго':
            'Порт-оф-Спейн', 'Тувалу': 'Фунафути', 'Тунис': 'Тунис', 'Туркменистан': 'Ашхабад',
            'Турция': 'Анкаpа', 'Уганда': 'Кампала', 'Узбекистан': 'Ташкент', 'Украина': 'Киев',
            'Уругвай': 'Монтевидео', 'Фиджи': 'Сува', 'Филиппины': 'Манила', 'Финляндия':
            'Хельсинки', 'Франция': 'Париж', 'Французская Полинезия': 'Папеэте', 'Хорватия':
            'Загреб', 'ЦАР': 'Банги', 'Чад': 'Нджамена', 'Черногория': 'Цетине', 'Чехия':
            'Прага', 'Чили': 'Сантьяго', 'Швейцария': 'Берн', 'Швеция': 'Стокгольм',
            'Шри-Ланка': 'Коломбо', 'Эквадор': 'Кито', 'Экваториальная Гвинея': 'Малабо',
            'Эритрея': 'Асмэра', 'Эстония': 'Таллинн', 'Эфиопия': 'Аддис-Абеба', 'ЮАР':
            'Претория', 'Ямайка': 'Кингстон', 'Япония': 'Токио'}
correctsubject={'Республика Адыгея': 'Майкоп', 'Республика Алтай': 'Горно-Алтайск', 'Республика Башкортостан':
                        'Уфа', 'Республика Бурятия': 'Улан-Удэ', 'Республика Дагестан': 'Махачкала',
                        'Республика Ингушетия': 'Магас', 'Республика Кабардино-Балкария': 'Нальчик',
                        'Республика Калмыкия': 'Элиста', 'Республика Карачаево-Черкесия': 'Черкесск',
                        'Республика Карелия': 'Петрозаводск', 'Республика Коми': 'Сыктывкар',
                        'Республика Крым': 'Симферополь', 'Республика Марий Эл': 'Йошкар-Ола',
                        'Республика Мордовия': 'Саранск', 'Республика Саха(Якутия)': 'Якутск',
                        'Республика Северная Осетия-Алания': 'Владикавказ', 'Республика Татарстан':
                        'Казань', 'Республика Тыва(Тува)': 'Кызыл', 'Республика Удмуртия': 'Ижевск',
                        'Республика Хакасия': 'Абакан', 'Республика Чечня': 'Грозный', 'Республика Чувашия':
                        'Чебоксары', 'Алтайский край': 'Барнаул', 'Забайкальский край': 'Чита',
                        'Камчатский край': 'Петропавловск-Камчатский', 'Краснодарский край': 'Краснодар',
                        'Красноярский край': 'Красноярск', 'Пермский край': 'Пермь', 'Приморский край':
                        'Владивосток', 'Ставропольский край': 'Ставрополь', 'Хабаровский край': 'Хабаровск',
                        'Еврейская Автономная область': 'Биробиджан', 'Ненецкий Автономный округ': 'Нарьян-Мар',
                        'Ханты-Мансийский Автономный округ-Югра': 'Ханты-Мансийск', 'Чукотский Автономный округ':
                        'Анадырь', 'Ямало-Ненецкий Автономный округ': 'Салехард', 'Амурская Область': 'Благовещенск',
                        'Архангельская Область': 'Архангельск', 'Астраханская Область': 'Астрахань',
                        'Белгородская Область': 'Белгород', 'Брянская Область': 'Брянск', 'Владимирская Область':
                        'Владимир', 'Волгоградская Область': 'Волгоград', 'Вологодская Область': 'Вологда',
                        'Воронежская Область': 'Воронеж', 'Ивановская Область': 'Иваново', 'Иркутская Область':
                        'Иркутск', 'Калининградская Область': 'Калининград', 'Калужская Область': 'Калуга',
                        'Кемеровская Область': 'Кемерово', 'Кировская Область': 'Киров', 'Костромская Область':
                        'Кострома', 'Курганская Область': 'Курган', 'Курская Область': 'Курск', 
                        'Ленинградская Область': 'Санкт-Петербург', 'Липецкая Область': 'Липецк',
                        'Магаданская Область': 'Магадан', 'Московская Область': 'Москва', 'Мурманская Область':
                        'Мурманск', 'Нижегородская Область': 'Нижний Новгород', 'Новгородская Область':
                        'Великий Новгород', 'Новосибирская Область': 'Новосибирск', 'Омская Область':
                        'Омск', 'Оренбургская Область': 'Оренбург', 'Орловская Область': 'Орёл',
                        'Пензенская Область': 'Пенза', 'Псковская Область': 'Псков', 'Ростовская Область':
                        'Ростов-на-Дону', 'Рязанская Область': 'Рязань', 'Самарская Область': 'Самара',
                        'Саратовская Область': 'Саратов', 'Сахалинская Область': 'Южно-Сахалинск',
                        'Свердловская Область': 'Екатеринбург', 'Смоленская Область': 'Смоленск',
                        'Тамбовская Область': 'Тамбов', 'Тверская Область': 'Тверь', 'Томская Область':
                        'Томск', 'Тульская Область': 'Тула', 'Тюменская Область': 'Тюмень', 'Ульяновская Область':
                        'Ульяновск', 'Челябинская Область': 'Челябинск', 'Ярославская Область': 'Ярославль'}	
objec=['Республика Адыгея', 'Республика Алтай', 'Республика Башкортостан', 'Республика Бурятия', 'Республика Дагестан', 
               'Республика Ингушетия', 'Республика Кабардино-Балкария','Республика Калмыкия', 'Республика Карачаево-Черкесия', 
               'Республика Карелия', 'Республика Коми', 'Республика Крым', 'Республика Марий Эл', 'Республика Мордовия',
               'Республика Саха(Якутия)', 'Республика Северная Осетия-Алания', 'Республика Татарстан', 'Республика Тыва(Тува)',
               'Республика Удмуртия', 'Республика Хакасия', 'Республика Чечня', 'Республика Чувашия', 'Алтайский край', 
               'Забайкальский край', 'Камчатский край', 'Краснодарский край', 'Красноярский край', 'Пермский край', 
	       'Приморский край', 'Ставропольский край', 'Хабаровский край', 'Еврейская Автономная область','Ненецкий Автономный округ', 
	       'Ханты-Мансийский Автономный округ-Югра', 'Чукотский Автономный округ', 'Ямало-Ненецкий Автономный округ', 'Амурская Область', 
	       'Архангельская Область', 'Астраханская Область', 'Белгородская Область', 'Брянская Область', 'Владимирская Область',
	       'Волгоградская Область', 'Вологодская Область', 'Воронежская Область', 'Ивановская Область', 'Иркутская Область', 
	       'Калининградская Область', 'Калужская Область', 'Кемеровская Область', 'Кировская Область', 'Костромская Область',
	       'Курганская Область', 'Курская Область', 'Ленинградская Область', 'Липецкая Область', 'Магаданская Область', 'Московская Область',
	       'Мурманская Область', 'Нижегородская Область', 'Новгородская Область', 'Новосибирская Область', 'Омская Область',
	       'Оренбургская Область', 'Орловская Область', 'Пензенская Область', 'Псковская Область', 'Ростовская Область', 'Рязанская Область',
	       'Самарская Область', 'Саратовская Область', 'Сахалинская Область', 'Свердловская Область', 'Смоленская Область', 'Тамбовская Область',
	       'Тверская Область', 'Томская Область', 'Тульская Область', 'Тюменская Область', 'Ульяновская Область', 'Челябинская Область', 'Ярославская Область']	
town=[ 'Майкоп',  'Горно-Алтайск', 'Уфа',  'Улан-Удэ',  'Махачкала',
	       'Магас',  'Нальчик','Элиста',  'Черкесск','Петрозаводск',  'Сыктывкар',
	       'Симферополь',  'Йошкар-Ола','Саранск',  'Якутск','Владикавказ', 
	       'Казань',  'Кызыл',  'Ижевск','Абакан',  'Грозный', 'Чебоксары',  
	       'Барнаул',  'Чита','Петропавловск-Камчатский', 'Краснодар','Красноярск',
	       'Пермь', 'Владивосток',  'Ставрополь',  'Хабаровск','Биробиджан',
	       'Нарьян-Мар','Ханты-Мансийск', 'Анадырь',  'Салехард',  'Благовещенск',
	       'Архангельск',  'Астрахань','Белгород',  'Брянск', 'Владимир', 'Волгоград',
	       'Вологда','Воронеж',  'Иваново', 'Иркутск',  'Калининград',  'Калуга',
	       'Кемерово',  'Киров', 'Кострома',  'Курган',  'Курск', 'Санкт-Петербург',
	       'Липецк','Магадан',  'Москва', 'Мурманск', 'Нижний Новгород', 'Великий Новгород',
	       'Новосибирск', 'Омск',  'Оренбург',  'Орёл','Пенза',  'Псков', 'Ростов-на-Дону',
	       'Рязань',  'Самара','Саратов',  'Южно-Сахалинск','Екатеринбург',  'Смоленск',
	       'Тамбов',  'Тверь', 'Томск',  'Тула',  'Тюмень', 'Ульяновск',  'Челябинск',
	       'Ярославль']
correct={'Алжир':'Алжир','Египет':'Каир','Западная Сахара':'Эль-Аюн','Ливия':'Триполи',
                 'Марокко':'Рабат','Судан':'Хартум','Тунис':'Тунис','Южный Судан':'Джуба',
                 'Бенин':'Порто-Ново','Буркина-Фасо':'Уагадугу','Исламская Республика Гамбия':'Банжул',
                 'Гана':'Аккра','Гвинея':'Конакри','Гвинея-Бисау':'Бисау','Кабо-Верде':'Прая',
                 'Кот д Ивуар': 'Ямусукро','Либерия':'Монровия','Мавритания':'Нуакшот',
                 'Мали':'Бамако','Нигер':'Ниамей','Нигерия':'Абуджа','Святая Елена, остров Вознесения, Тристан-да-Кунья':
                 'Джеймстаун','Сенегал':'Дакар','Сьерра-Леоне':'Фритаун','Того':'Ломе',
                 'Ангола':'Луанда','Габон':'Либревиль','Камерун':'Яунде','Конго':'Браззавиль',
                 'Конго, демократическая республика':'Киншаса','Сан-Томе и Принсипи':'Бисау',
                 'Центрально-Африканская Республика':'Банги','Чад':'Нджамена','Экваториальная Гвинея':'Малабо',
                 'Бурунди':'Бужумбура','Джибути':'Джибути','Замбия':'Лусака','Зимбабве':'Хараре',
                 'Кения':'Найроби','Коморы':'Морони','Маврикий':'Порт-Луи','Мадагаскар':'Антананариву',
                 'Малави':'Лилонгве','Мозамбик':'Мапуту','Реюньон':'Сен-Дени','Руанда':'Кигали',
                 'Сейшелы':'Виктория','Сомали':'Могадишо','Танзания, объединенная республика':'Додома',
                 'Уганда':'Кампала','Эритрея':'Асмэра','Эфиопия':'Аддис-Абеба','Майотта':'Мамуцу',
                 'Южный Судан':'Джуба','Ботсвана':'Габороне','Лесото':'Масеру','Намибия':'Виндхук',
                 'Свазиленд':'Мбабане','Южная Африка':'Претория'}	
country=['Алжир','Египет','Западная Сахара','Ливия',
                 'Марокко','Судан','Тунис','Южный Судан',
                 'Бенин','Буркина-Фасо','Исламская Республика Гамбия',
                 'Гана','Гвинея','Гвинея-Бисау','Кабо-Верде',
                 'Кот д Ивуар','Либерия','Мавритания',
                 'Мали','Нигер','Нигерия','Святая Елена, остров Вознесения, Тристан-да-Кунья'
                 ,'Сенегал','Сьерра-Леоне','Того',
		 'Ангола','Габон','Камерун','Конго',
		 'Конго, демократическая республика','Сан-Томе и Принсипи',
		 'Центрально-Африканская Республика','Чад','Экваториальная Гвинея',
		 'Бурунди','Джибути','Замбия','Зимбабве',
		 'Кения','Коморы','Маврикий','Мадагаскар',
		 'Малави','Мозамбик','Реюньон','Руанда',
		 'Сейшелы','Сомали','Танзания, объединенная республика',
		 'Уганда','Эритрея','Эфиопия','Майотта',
		 'Южный Судан','Ботсвана','Лесото','Намибия',
		 'Свазиленд','Южная Африка']	
cityand=['Алжир','Каир','Эль-Аюн','Триполи',
		 'Рабат','Хартум','Тунис','Джуба',
		 'Порто-Ново','Уагадугу','Банжул',
		 'Аккра','Конакри','Бисау','Прая',
		  'Ямусукро','Монровия','Нуакшот',
		 'Бамако','Ниамей','Абуджа',
		 'Джеймстаун','Дакар','Фритаун','Ломе',
		 'Луанда','Либревиль','Яунде','Браззавиль',
		 'Киншаса','Бисау',
		 'Банги','Нджамена','Малабо',
		 'Бужумбура','Джибути','Лусака','Хараре',
		 'Найроби','Морони','Порт-Луи','Антананариву',
		 'Лилонгве','Мапуту','Сен-Дени','Кигали',
		 'Виктория','Могадишо','Додома',
		 'Кампала','Асмэра','Аддис-Абеба','Мамуцу',
		 'Джуба','Габороне','Масеру','Виндхук',
		 'Мбабане','Претория']